# ============================================================
# УМОВНИЙ ОПЕРАТОР: if / elif / else
# ============================================================
# Перевіряє вираз і виконує відповідний блок коду.
# Відступ (4 пробіли або Tab) — обов'язковий.
# Python визначає блоки коду саме по відступах.

# --- Базовий if / else ---

current_url = "https://www.saucedemo.com/inventory.html"
expected_url = "https://www.saucedemo.com/inventory.html"

if current_url == expected_url:
    print("Логін успішний")
    is_logged_in = True
else:
    print("Помилка логіну")
    is_logged_in = False

# --- Оператори порівняння ---
# ==   рівне
# !=   не рівне
# >    більше
# <    менше
# >=   більше або рівне
# <=   менше або рівне

# --- if / elif / else: кілька гілок ---

cart_count = 2
expected_count = 3

if cart_count == expected_count:
    print("Всі товари у кошику")
elif cart_count > 0:
    print(f"У кошику {cart_count} з {expected_count} товарів")
else:
    print("Кошик порожній")


# ============================================================
# ЗАВДАННЯ
# ============================================================
# Дано змінна score = 75
# Написати умову:
#   — якщо score >= 90  → вивести "Відмінно"
#   — якщо score >= 70  → вивести "Добре"
#   — якщо score >= 50  → вивести "Задовільно"
#   — інакше            → вивести "Незадовільно"
#
# Після написання — змінити значення score і перевірити всі 4 гілки.

score = 75

# --- місце для коду ---
